## Production: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| recreate | `aws_route53_zone.internal_dns`                              |
|          | `aws_secretsmanager_secret_version.internal_dns_cert_base64` |
|          | `tls_self_signed_cert.internal_dns`                          |
| add      | `aws_secretsmanager_secret.internal_dns_fqdn`                |
|          | `aws_secretsmanager_secret_version.internal_dns_fqdn`        |
| update   | `aws_acm_certificate.internal_dns`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.internal_dns will be updated in-place
  ~ resource "aws_acm_certificate" "internal_dns" {
      ~ certificate_body          = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDGTCCAgGgAwIBAgIQBnnXlsDInVEboGfM3+Cr/DANBgkqhkiG9w0BAQsFADAt
            MSswKQYDVQQDDCIqLnByb2R1Y3Rpb24ubm90aWZpY2F0aW9uLmludGVybmFsMB4X
            DTI0MDIwNjE2NDg0NVoXDTI5MDIwNDE2NDg0NVowLTErMCkGA1UEAwwiKi5wcm9k
            dWN0aW9uLm5vdGlmaWNhdGlvbi5pbnRlcm5hbDCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAMcJdw3Wt5CM8g1T8pDYD/y1ni3kcchfUoqe3gZfi/3ehzTZ
            7gS0oijVGehA8qOfO3evCsdMuBL87H2oSQ+6oduUxucq/iDKqLwACd7IxZEnylWb
            cmYBNebXtcGwbA+SbH95wbbW4G8aw/5CsWHUaj+DsvKdXnQSIr7BAttr3KmL7rtC
            M9TjidYmaaVwMmwufcDPPitLtQT6sdma/FYWR5XZXBZowtjoOMGD76Uj7Vxv/xaW
            4XtlfvUXF4xaG6wZgTqlK1wsSByAppQWAYDeXE5+z9Wirs0oVF/7KZzfvs9j6SsW
            SR18bdWHycJm4OmtTNzapzgwQMSGbAAOzXk3ZVcCAwEAAaM1MDMwDgYDVR0PAQH/
            BAQDAgWgMBMGA1UdJQQMMAoGCCsGAQUFBwMBMAwGA1UdEwEB/wQCMAAwDQYJKoZI
            hvcNAQELBQADggEBAGTOedQpa3K1YvEXboLn7r/j1r1My4h0dog7fwxB9x+EvcWN
            R9KBDstqfEWGdtVGWJ0dA0vRoDCXmvRh+Q1OAY6o1E/e9pAYq4GM7KnKT3lElvxl
            LvrbetSLY3Y2IXY9fTM0MqCFXu3SjG3GTw2vWoUGXGj236h5Gpn1llWTiysP6zbz
            nhVUJBYSTGeuuUa3jF9e4sV7pXwqgpChoiF6MdiCHCy51A2AaL2DlEsjmqh7C2O9
            UImVgYPvoMYf4vnU02yewNTzoSdBlVSc2nVOxyRYNxxAu+lpj0oiJLUEmiw+S7R4
            fPNrQwGvO96Pi0BtdI8H3MZB6h92MpLdVv6ztl4=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
        id                        = "arn:aws:acm:ca-central-1:296255494825:certificate/66f4d857-1e0a-4b4d-8c48-f2b5d2ac87c1"
        tags                      = {
            "CostCenter" = "notification-canada-ca-production"
            "Name"       = "notification-canada-ca"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_zone.internal_dns must be replaced
+/- resource "aws_route53_zone" "internal_dns" {
      ~ arn                 = "arn:aws:route53:::hostedzone/Z04039242WVL6VNQ7FX6A" -> (known after apply)
      ~ id                  = "Z04039242WVL6VNQ7FX6A" -> (known after apply)
      ~ name                = "production.notification.internal" -> "production.notification.internal.com" # forces replacement
      ~ name_servers        = [
          - "ns-0.awsdns-00.com.",
          - "ns-1024.awsdns-00.org.",
          - "ns-1536.awsdns-00.co.uk.",
          - "ns-512.awsdns-00.net.",
        ] -> (known after apply)
      ~ primary_name_server = "ns-0.awsdns-00.com." -> (known after apply)
      - tags                = {} -> null
      ~ tags_all            = {} -> (known after apply)
      ~ zone_id             = "Z04039242WVL6VNQ7FX6A" -> (known after apply)
        # (2 unchanged attributes hidden)

      - vpc {
          - vpc_id     = "vpc-0e02e0295db594518" -> null
          - vpc_region = "ca-central-1" -> null
        }
      + vpc {
          + vpc_id     = "vpc-0e02e0295db594518"
          + vpc_region = (known after apply)
        }
    }

  # aws_secretsmanager_secret.internal_dns_fqdn will be created
  + resource "aws_secretsmanager_secret" "internal_dns_fqdn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "INTERNAL_DNS_FQDN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.internal_dns_cert_base64 must be replaced
-/+ resource "aws_secretsmanager_secret_version" "internal_dns_cert_base64" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:INTERNAL_DNS_CERT_BASE64-UexaEv" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:INTERNAL_DNS_CERT_BASE64-UexaEv|D301814E-5E9D-4A3C-9E96-8F286F740A10" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "D301814E-5E9D-4A3C-9E96-8F286F740A10" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.internal_dns_fqdn will be created
  + resource "aws_secretsmanager_secret_version" "internal_dns_fqdn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # tls_self_signed_cert.internal_dns must be replaced
+/- resource "tls_self_signed_cert" "internal_dns" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDGTCCAgGgAwIBAgIQBnnXlsDInVEboGfM3+Cr/DANBgkqhkiG9w0BAQsFADAt
            MSswKQYDVQQDDCIqLnByb2R1Y3Rpb24ubm90aWZpY2F0aW9uLmludGVybmFsMB4X
            DTI0MDIwNjE2NDg0NVoXDTI5MDIwNDE2NDg0NVowLTErMCkGA1UEAwwiKi5wcm9k
            dWN0aW9uLm5vdGlmaWNhdGlvbi5pbnRlcm5hbDCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAMcJdw3Wt5CM8g1T8pDYD/y1ni3kcchfUoqe3gZfi/3ehzTZ
            7gS0oijVGehA8qOfO3evCsdMuBL87H2oSQ+6oduUxucq/iDKqLwACd7IxZEnylWb
            cmYBNebXtcGwbA+SbH95wbbW4G8aw/5CsWHUaj+DsvKdXnQSIr7BAttr3KmL7rtC
            M9TjidYmaaVwMmwufcDPPitLtQT6sdma/FYWR5XZXBZowtjoOMGD76Uj7Vxv/xaW
            4XtlfvUXF4xaG6wZgTqlK1wsSByAppQWAYDeXE5+z9Wirs0oVF/7KZzfvs9j6SsW
            SR18bdWHycJm4OmtTNzapzgwQMSGbAAOzXk3ZVcCAwEAAaM1MDMwDgYDVR0PAQH/
            BAQDAgWgMBMGA1UdJQQMMAoGCCsGAQUFBwMBMAwGA1UdEwEB/wQCMAAwDQYJKoZI
            hvcNAQELBQADggEBAGTOedQpa3K1YvEXboLn7r/j1r1My4h0dog7fwxB9x+EvcWN
            R9KBDstqfEWGdtVGWJ0dA0vRoDCXmvRh+Q1OAY6o1E/e9pAYq4GM7KnKT3lElvxl
            LvrbetSLY3Y2IXY9fTM0MqCFXu3SjG3GTw2vWoUGXGj236h5Gpn1llWTiysP6zbz
            nhVUJBYSTGeuuUa3jF9e4sV7pXwqgpChoiF6MdiCHCy51A2AaL2DlEsjmqh7C2O9
            UImVgYPvoMYf4vnU02yewNTzoSdBlVSc2nVOxyRYNxxAu+lpj0oiJLUEmiw+S7R4
            fPNrQwGvO96Pi0BtdI8H3MZB6h92MpLdVv6ztl4=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "8608008556545021586602784807932963836" -> (known after apply)
      ~ key_algorithm         = "RSA" -> (known after apply)
      ~ validity_end_time     = "2029-02-04T16:48:45.079312292Z" -> (known after apply)
      ~ validity_start_time   = "2024-02-06T16:48:45.079312292Z" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ subject { # forces replacement
          ~ common_name = "*.production.notification.internal" -> "production.notification.internal.com" # forces replacement
        }
    }

Plan: 5 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  + internal_dns_name              = "production.notification.internal.com"
  ~ internal_dns_zone_id           = "Z04039242WVL6VNQ7FX6A" -> (known after apply)
  ~ notification_internal_dns_cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURHVENDQWdHZ0F3SUJBZ0lRQm5uWGxzREluVkVib0dmTTMrQ3IvREFOQmdrcWhraUc5dzBCQVFzRkFEQXQKTVNzd0tRWURWUVFERENJcUxuQnliMlIxWTNScGIyNHVibTkwYVdacFkyRjBhVzl1TG1sdWRHVnlibUZzTUI0WApEVEkwTURJd05qRTJORGcwTlZvWERUSTVNREl3TkRFMk5EZzBOVm93TFRFck1Da0dBMVVFQXd3aUtpNXdjbTlrCmRXTjBhVzl1TG01dmRHbG1hV05oZEdsdmJpNXBiblJsY201aGJEQ0NBU0l3RFFZSktvWklodmNOQVFFQkJRQUQKZ2dFUEFEQ0NBUW9DZ2dFQkFNY0pkdzNXdDVDTThnMVQ4cERZRC95MW5pM2tjY2hmVW9xZTNnWmZpLzNlaHpUWgo3Z1Mwb2lqVkdlaEE4cU9mTzNldkNzZE11Qkw4N0gyb1NRKzZvZHVVeHVjcS9pREtxTHdBQ2Q3SXhaRW55bFdiCmNtWUJOZWJYdGNHd2JBK1NiSDk1d2JiVzRHOGF3LzVDc1dIVWFqK0RzdktkWG5RU0lyN0JBdHRyM0ttTDdydEMKTTlUamlkWW1hYVZ3TW13dWZjRFBQaXRMdFFUNnNkbWEvRllXUjVYWlhCWm93dGpvT01HRDc2VWo3Vnh2L3hhVwo0WHRsZnZVWEY0eGFHNndaZ1RxbEsxd3NTQnlBcHBRV0FZRGVYRTUrejlXaXJzMG9WRi83S1p6ZnZzOWo2U3NXClNSMThiZFdIeWNKbTRPbXRUTnphcHpnd1FNU0diQUFPelhrM1pWY0NBd0VBQWFNMU1ETXdEZ1lEVlIwUEFRSC8KQkFRREFnV2dNQk1HQTFVZEpRUU1NQW9HQ0NzR0FRVUZCd01CTUF3R0ExVWRFd0VCL3dRQ01BQXdEUVlKS29aSQpodmNOQVFFTEJRQURnZ0VCQUdUT2VkUXBhM0sxWXZFWGJvTG43ci9qMXIxTXk0aDBkb2c3Znd4Qjl4K0V2Y1dOClI5S0JEc3RxZkVXR2R0VkdXSjBkQTB2Um9EQ1htdlJoK1ExT0FZNm8xRS9lOXBBWXE0R003S25LVDNsRWx2eGwKTHZyYmV0U0xZM1kySVhZOWZUTTBNcUNGWHUzU2pHM0dUdzJ2V29VR1hHajIzNmg1R3BuMWxsV1RpeXNQNnpiegpuaFZVSkJZU1RHZXV1VWEzakY5ZTRzVjdwWHdxZ3BDaG9pRjZNZGlDSEN5NTFBMkFhTDJEbEVzam1xaDdDMk85ClVJbVZnWVB2b01ZZjR2blUwMnlld05Uem9TZEJsVlNjMm5WT3h5UllOeHhBdStscGowb2lKTFVFbWl3K1M3UjQKZlBOclF3R3ZPOTZQaTBCdGRJOEgzTVpCNmg5Mk1wTGRWdjZ6dGw0PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
